docs/logic_model.tex
% Created 2024-02-09 Fri 14:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Bhargavi}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Bhargavi},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Context}
\label{sec:orgc76e48f}
Students new to an Operating systems course are often overwhelmed by the vastness and the depth of the course. And the course content often doesn't provide the right abstraction for a beginner to understand the workflow of the mechanisms and how they interact with other mechanims within the OS. Students are often clueless about the internal flow of the mechanisms.

\section{Purpose}
\label{sec:org723c3db}
We primarily aim at bringing an in depth understanding of OS mechanisms and to introduce the student to the ideology of viewing a system as a transitional state model with simply changes depending on the action taken by the user or any other internal actions.

\section{Activities}
\label{sec:org25953d6}
\begin{itemize}
\item The student is going to play different roles at different times during the whole simulation. The roles played by the student are mainly 'User', 'Hardware', and 'Kernel', 'scheduler' etc.
\item Aided with the prompts and feedbacks provided as a response to their previous actions, the student needs to perform right actions to succesfully do context switch between two process.
\end{itemize}

\section{Constraints}
\label{sec:org23cc95a}
\begin{itemize}
\item The experiments don't have access to variety of actions during the simulations.
\item The experiments are designed based on the Linux OS.
\end{itemize}

\section{Outcomes}
\label{sec:org753d80c}
\begin{itemize}
\item Student will be able to appreciate how different actions perfromed by different modes and subsytems operate together to complete the task of in the OS.
\item To develope an high level abstract overview of the actors interacting in the OS.
\item Understanding these dynamic systems in the form of transition states.
\end{itemize}
\end{document}
